test.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://xml.apache.org/xml-soap" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Body><ExecuteQuery xmlns="urn:xtk:queryDef" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><__sessiontoken xsi:type="xsd:String">admin/KuejLyn3</__sessiontoken><entity SOAP-ENV:encodingStyle="http://xml.apache.org/xml-soap/literalxml" xsi:type="ns:Element"><queryDef operation="select" schema="ecp:results"><select><node expr="@id"/><node expr="@souce"/><node expr="@datetime"/><node expr="@link"/></select></queryDef></entity></ExecuteQuery></SOAP-ENV:Body></SOAP-ENV:Envelope>